novaeco/n32r16/configs/esp32s2/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s2"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="../partitions/esp32s2_8MB.csv"
CONFIG_ESP32S2_DEFAULT_CPU_FREQ_240=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LWIP_LOCAL_HOSTNAME="sensor-node"
CONFIG_ESP32S2_DATA_CACHE_LINE_64B=y
